plonas/winsens/src/hardware/ble_peripheral/nrf52/ble_peripheral.c
/*
 * ble_peripheral.c
 *
 *  Created on: 20.02.2021
 *      Author: Damian Plonek
 */

#include "ble_peripheral.h"
#include "ble_peripheral_cfg.h"
#include "config.h"
#include "config_cfg.h"
#define ILOG_MODULE_NAME SVBT
#include "log.h"
#include "log_internal_nrf52.h"
#include "utils.h"
#include "winsens_types.h"
#include "window_state_cfg.h"

#include "app_timer.h"
#include "app_util.h"
#include "ble.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "fds.h"
#include "nrf_ble_gatt.h"
#include "nrf_sdh_ble.h"
#include "peer_manager.h"


#define APP_BLE_CONN_CFG_TAG            1                                           /**< A tag identifying the SoftDevice BLE configuration. */
#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define DEVICE_NAME                     "WinSensDev"                                /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "DamianPłonek"                              /**< Manufacturer. Will be passed to Device Information Service. */

#define APP_ADV_INTERVAL                128                                         /**< The advertising interval (in units of 0.625 ms. This value corresponds to 80 ms). */
#define APP_ADV_DURATION                0                                           /**< The advertising timeout in units of 10ms. */
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)            /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)            /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                           /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                           /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                           /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                           /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                        /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                           /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                           /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                          /**< Maximum encryption key size. */

#define SERVICES_NUMBER                 (sizeof(g_services)/sizeof(ble_peripheral_svc_t))
#define CHARACTERISTICS_NUMBER          (sizeof(g_characteristics)/sizeof(ble_peripheral_char_t))
#define WHITELIST_LEN                   BLE_GAP_WHITELIST_ADDR_MAX_COUNT


typedef enum
{
    BLE_PERIPHERAL_EVT_CONNECT,
    BLE_PERIPHERAL_EVT_CONNECTED,
    BLE_PERIPHERAL_EVT_DISCONNECT,
    BLE_PERIPHERAL_EVT_DISCONNECTED,
    BLE_PERIPHERAL_EVT_ADVERTISE,
    BLE_PERIPHERAL_EVT_ADVERTISING_STARTED,
    BLE_PERIPHERAL_EVT_ADVERTISING_STOPPED,
    BLE_PERIPHERAL_EVT_WRITE,

    BLE_PERIPHERAL_EVT_UNBOND,
    BLE_PERIPHERAL_EVT_UNBONDED,
    BLE_PERIPHERAL_EVT_BOND,
    BLE_PERIPHERAL_EVT_BONDED,

} ble_peripheral_evt_enum_t;

typedef void (*ble_peripheral_evt_handler_t)(winsens_event_t event);
typedef void (*ble_peripheral_state_entry_t)(void);
typedef void (*ble_peripheral_state_exit_t)(void);

typedef struct WS_ServerBtState_s
{
    ble_peripheral_state_enum_t     state_id;
    ble_peripheral_evt_handler_t    evt_handler;
    ble_peripheral_state_entry_t    enter_state;
    ble_peripheral_state_exit_t     exit_state;

} ble_peripheral_state_t;


static void ble_stack_init(void);
static void gap_params_init(void);
static void conn_params_init(void);
static void peer_manager_init(bool erase_bonds);
static void services_init(void);
static void advertising_init(void);

static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt);
static void pm_evt_handler(pm_evt_t const * p_evt);
static void on_conn_params_evt_handler(ble_conn_params_evt_t * p_evt);
static void conn_params_error_handler(uint32_t nrf_error);
static void evt_handler(winsens_event_t event);

static void change_state(const ble_peripheral_state_t *new_state);

static void empty_evt_handler(winsens_event_t event) {}
static void empty_on_enter(void) {}
static void empty_on_exit(void) {}

static void connected_evt_handler(winsens_event_t event);
//static void connecting_evt_handler(winsens_event_t event);
static void disconnected_evt_handler(winsens_event_t event);
static void disconnecting_evt_handler(winsens_event_t event);
static void advertising_evt_handler(winsens_event_t event);
static void bonding_evt_handler(winsens_event_t event);
static void unbonding_evt_handler(winsens_event_t event);

static void disconnected_on_enter(void);
static void disconnecting_on_enter(void);
static void advertising_on_enter(void);
static void bonding_on_enter(void);
static void unbonding_on_enter(void);

static void advertising_on_exit(void);

static void add_service(ble_peripheral_svc_t *svc);
static void add_characteristic(ble_peripheral_char_t *charact);
static void remove_all_bondings(void);
static bool disconnect(uint16_t connHandle);
static void start_advertising(ble_gap_addr_t* addr);
static bool bond(uint16_t connHandle);
static bool add_to_whitelist(pm_peer_id_t peerId);
static void notify_on_write(const ble_peripheral_update_t *update_data);
static ble_peripheral_char_id_t get_char_id(uint16_t attr_handle);
static char const * convert_state_to_str(ble_peripheral_state_enum_t state);


