plonas/winsens/src/hardware/ble_peripheral/nrf52/ble_peripheral.c
const static ble_peripheral_state_t UNKNOWN_STATE           = { BLE_PERIPHERAL_STATE_UNKNOWN, empty_evt_handler, empty_on_enter, empty_on_exit };
const static ble_peripheral_state_t CONNECTED_STATE         = { BLE_PERIPHERAL_STATE_CONNECTED, connected_evt_handler, empty_on_enter, empty_on_exit };
const static ble_peripheral_state_t DISCONNECTED_STATE      = { BLE_PERIPHERAL_STATE_DISCONNECTED, disconnected_evt_handler, disconnected_on_enter, empty_on_exit };
const static ble_peripheral_state_t DISCONNECTING_STATE     = { BLE_PERIPHERAL_STATE_DISCONNECTING, disconnecting_evt_handler, disconnecting_on_enter, disconnecting_on_enter };
const static ble_peripheral_state_t ADVERTISING_STATE       = { BLE_PERIPHERAL_STATE_ADVERTISING, advertising_evt_handler, advertising_on_enter, advertising_on_exit };
const static ble_peripheral_state_t BONDING_STATE           = { BLE_PERIPHERAL_STATE_BONDING, bonding_evt_handler, bonding_on_enter, empty_on_exit };
const static ble_peripheral_state_t UNBONDING_STATE         = { BLE_PERIPHERAL_STATE_UNBONDING, unbonding_evt_handler, unbonding_on_enter, empty_on_exit };


static bool g_ble_peripheral_init                           = false;
static bool g_connectable                                   = false;
static uint16_t g_conn_handle                               = BLE_CONN_HANDLE_INVALID;                                      /**< Handle of the current connection. */
static const ble_peripheral_state_t *g_current_state        = &UNKNOWN_STATE;
//static ble_uuid_t g_adv_uuids[]                             = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};   /**< Universally unique service identifiers. */

static ble_peripheral_svc_t g_services[] = BLE_PERIPHERAL_SERVICES_INIT;
static ble_peripheral_char_t g_characteristics[] = BLE_PERIPHERAL_CHARS_INIT;
static ble_uuid_t g_adv_uuids[] = {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */
static pm_peer_id_t g_whitelist[WHITELIST_LEN] = {PM_PEER_ID_INVALID};
static ble_peripheral_cb_t g_callbacks[BLE_PERIPERAL_MAX_CALLBACKS] = {NULL};


LOG_REGISTER();
BLE_ADVERTISING_DEF(g_advertising);
NRF_BLE_GATT_DEF(g_gatt);


winsens_status_t ble_peripheral_init(void)
{
    winsens_status_t status = WINSENS_OK;

    if (false == g_ble_peripheral_init)
    {
        g_ble_peripheral_init = true;

        ble_stack_init();
        gap_params_init();

        ret_code_t err_code = nrf_ble_gatt_init(&g_gatt, gatt_evt_handler);
        LOG_NRF_ERROR_RETURN(err_code, WINSENS_ERROR);

        conn_params_init();

        peer_manager_init(false);

        err_code = pm_register(pm_evt_handler);
        LOG_NRF_ERROR_RETURN(err_code, WINSENS_ERROR);

        services_init();
        advertising_init();

        change_state(&ADVERTISING_STATE);
    }

    return status;
}

winsens_status_t ble_peripheral_disconnect()
{
    change_state(&DISCONNECTING_STATE);
    return WINSENS_OK;
}

winsens_status_t ble_peripheral_start_advertising(void)
{
    change_state(&ADVERTISING_STATE);
    return WINSENS_OK;
}

winsens_status_t ble_peripheral_delete_all_peers()
{
    change_state(&UNBONDING_STATE);
    return WINSENS_OK;
}

winsens_status_t ble_peripheral_bond(void)
{
    change_state(&BONDING_STATE);
    return WINSENS_OK;
}

winsens_status_t ble_peripheral_unbond(void)
{
    change_state(&UNBONDING_STATE);
    return WINSENS_OK;
}

winsens_status_t ble_peripheral_subscribe(ble_peripheral_cb_t callback)
{
    for (uint32_t i = 0; i < BLE_PERIPERAL_MAX_CALLBACKS; ++i)
    {
        if (NULL == g_callbacks[i])
        {
            g_callbacks[i] = callback;
            return WINSENS_OK;
        }
    }

    return WINSENS_NO_RESOURCES;
}

winsens_status_t ble_peripheral_update(ble_peripheral_svc_id_t server_id, ble_peripheral_char_id_t char_id, uint16_t value_len, uint8_t const *value)
{
    ble_gatts_hvx_params_t hv_params;
    hv_params.handle = g_characteristics[char_id].char_handle.value_handle;
    hv_params.type = BLE_GATT_HVX_NOTIFICATION;
    hv_params.offset = 0;
    hv_params.p_len = &value_len;
    hv_params.p_data = value;

    sd_ble_gatts_hvx(g_conn_handle, &hv_params);
    return WINSENS_OK;
}

ble_peripheral_state_enum_t ble_peripheral_get_state(void)
{
    return g_current_state->state_id;
}

static void ble_stack_init(void)
{
    ret_code_t err_code;

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    LOG_NRF_ERROR_RETURN(err_code, ;);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    LOG_NRF_ERROR_RETURN(err_code, ;);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, on_ble_evt, NULL);
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    LOG_NRF_ERROR_RETURN(err_code, ;);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       WS_LOG_NRF_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    LOG_NRF_ERROR_RETURN(err_code, ;);
}

static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt_handler;
    cp_init.error_handler                  = conn_params_error_handler;

