plonas/winsens/src/hardware/ble_peripheral/nrf52/ble_peripheral.c
    err_code = ble_conn_params_init(&cp_init);
    LOG_NRF_ERROR_RETURN(err_code, ;);
}

static void peer_manager_init(bool erase_bonds)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    ble_conn_state_init();
    err_code = pm_init();
    LOG_NRF_ERROR_RETURN(err_code, ;);

    if (erase_bonds)
    {
        err_code = pm_peers_delete();
        LOG_NRF_ERROR_RETURN(err_code, ;);
    }

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    LOG_NRF_ERROR_RETURN(err_code, ;);
}

static void services_init(void)
{
    for (uint8_t svc_id = 0; svc_id < SERVICES_NUMBER; ++svc_id)
    {
        add_service(&g_services[svc_id]);

        for (uint8_t char_id = 0; char_id < CHARACTERISTICS_NUMBER; ++char_id)
        {
            if (svc_id ==  g_characteristics[char_id].service_id)
            {
                LOG_DEBUG("char_id: %d", char_id);
                add_characteristic(&g_characteristics[char_id]);
            }
        }
    }
}

static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(g_adv_uuids) / sizeof(g_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = g_adv_uuids;

    init.config.ble_adv_on_disconnect_disabled  = true;
    init.config.ble_adv_fast_enabled            = true;
    init.config.ble_adv_fast_interval           = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout            = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&g_advertising, &init);
    LOG_NRF_ERROR_RETURN(err_code, ;);

    ble_advertising_conn_cfg_tag_set(&g_advertising, APP_BLE_CONN_CFG_TAG);
}

static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
        {
//            NRF_LOG_INFO("Fast advertising.");
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_ADVERTISING_STARTED, .data = 0 };
            evt_handler(e);
        } break;

        case BLE_ADV_EVT_IDLE:
        {
//            sleep_mode_enter();
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_ADVERTISING_STOPPED, .data = 0 };
            evt_handler(e);
        } break;

        default:
            break;
    }
}

static void on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t err_code = NRF_SUCCESS;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_DISCONNECTED:
        {
            LOG_INFO("BLE_GAP_EVT_DISCONNECTED");
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_DISCONNECTED, .data = 0 };
            evt_handler(e);
            break; // BLE_GAP_EVT_DISCONNECTED
        }

        case BLE_GAP_EVT_CONNECTED:
        {
            LOG_INFO("BLE_GAP_EVT_CONNECTED");
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_CONNECTED, .data = p_ble_evt->evt.gap_evt.conn_handle };
            evt_handler(e);
            break; // BLE_GAP_EVT_CONNECTED
        }

        case BLE_GAP_EVT_TIMEOUT:
            LOG_DEBUG("BLE_GAP_EVT_TIMEOUT %u.", p_ble_evt->evt.gap_evt.params.timeout.src);
            break;

        case BLE_GATTC_EVT_TIMEOUT:
        {
            // Disconnect on GATT Client timeout event.
            LOG_DEBUG("GATT Client Timeout.");
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_DISCONNECT, .data = p_ble_evt->evt.gattc_evt.conn_handle };
            evt_handler(e);
            break; // BLE_GATTC_EVT_TIMEOUT
        }

        case BLE_GATTS_EVT_TIMEOUT:
        {
            // Disconnect on GATT Server timeout event.
            LOG_DEBUG("GATT Server Timeout.");
            winsens_event_t e = { .id = BLE_PERIPHERAL_EVT_DISCONNECT, .data = p_ble_evt->evt.gatts_evt.conn_handle };
            evt_handler(e);
            break; // BLE_GATTS_EVT_TIMEOUT
        }

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.gattc_evt.conn_handle, NULL);
            LOG_NRF_ERROR_CHECK(err_code);
            break; // BLE_EVT_USER_MEM_REQUEST

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    LOG_NRF_WARNING_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

